davidhuwyler/openmv/src/omv_imxrt/sensor.c
/*
 * This file is part of the OpenMV project.
 * Copyright (c) 2013/2014 Ibrahim Abdelkader <i.abdalkader@gmail.com>
 * This work is licensed under the MIT license, see the file LICENSE for details.
 *
 * Sensor abstraction layer.
 *
 */

#include <stdlib.h>
#include <string.h>
#include "mp.h"
#include "irq.h"
#include "cambus.h"
#include "ov9650.h"
#include "ov2640.h"
#include "ov7725.h"
#include "ov7725_regs.h"
#include "mt9v034.h"
#include "sensor.h"
#include "systick.h"
#include "framebuffer.h"
#include "fsl_clock.h"
#include "fsl_csi.h"
#include "fsl_debug_console.h"
#include "fsl_camera_receiver.h"
#include "fsl_csi_camera_adapter.h"
#include "fsl_camera.h"
#include "fsl_camera_receiver.h"
#include "fsl_camera_device.h"
#include "fsl_ov7725.h"
#include "fsl_elcdif.h"
#include "fsl_edma.h"
#include "fsl_dmamux.h"
#include "omv_boardconfig.h"
#include "fsl_cache.h"

//----- TODO Dave Defines only for testing -------
#define USE_LineBuffer
//-----

#ifndef RAM_CODE
#define RAM_CODE __attribute__((section(".ramfunc.$SRAM_ITC")))
//#define RAM_CODE
#endif

#define OV_CHIP_ID      (0x0A)
#define ON_CHIP_ID      (0x00)
#define MAX_XFER_SIZE (0xFFFC)

#define NO_LCD_MONITOR
//#define OV7725_I2C LPI2C1

/* LCD definition. */
#define APP_ELCDIF LCDIF

#define APP_LCD_HEIGHT 272
#define APP_LCD_WIDTH 480
#define APP_HSW 41
#define APP_HFP 4
#define APP_HBP 8
#define APP_VSW 10
#define APP_VFP 4
#define APP_VBP 2
#define APP_LCD_POL_FLAGS \
    (kELCDIF_DataEnableActiveHigh | kELCDIF_VsyncActiveLow | kELCDIF_HsyncActiveLow | kELCDIF_DriveDataOnRisingClkEdge)

#define APP_LCDIF_DATA_BUS kELCDIF_DataBus16Bit

/* Display. */
#define LCD_DISP_GPIO GPIO1
#define LCD_DISP_GPIO_PIN 2
/* Back light. */
#define LCD_BL_GPIO GPIO2
#define LCD_BL_GPIO_PIN 31

#define APP_BPP 2
/* Camera definition. */
#define APP_CAMERA_HEIGHT 240
#define APP_CAMERA_WIDTH 320
#define APP_CAMERA_CONTROL_FLAGS (kCAMERA_HrefActiveHigh | kCAMERA_DataLatchOnRisingEdge)
#define APP_FRAME_BUFFER_COUNT 4
#define FRAME_BUFFER_ALIGN 64
sensor_t s_sensor;

/*static*/ volatile uint8_t s_isOmvSensorSnapshotReady;

/*******************************************************************************
 * Variables
 ******************************************************************************/
#ifndef NO_LCD_MONITOR
#define LCD_FB __attribute__((section(".lcd_fb")))
/*static*/ LCD_FB uint16_t s_frameBuffer[2][272][480] ;
#endif

typedef struct _ov7725_reg
{
    uint8_t reg;
    uint8_t val;
} ov7725_reg_t;

//static const ov7725_reg_t ov7725InitRegs[] = {   //note that:we use our rt defaults reg to replace the openmv's,beacause some diffetents will cause the program fail,the rate of the  lcd flushing is very high,do not know which one have an effect on this
//    {COM3,          0x00},//if we set the varible COM3_SWAP_YUV,the picture will be a mass one 
//    {COM7,          COM7_RES_VGA | COM7_FMT_RGB565 | COM7_FMT_RGB},
//    {0x3d, 0x03},
//    {0x42, 0x7f},
//    {0x4d, 0x09},

//    /* DSP */
//    {0x64, 0xff},
//    {0x65, 0x20},
//    {0x66, 0x00},
//    {0x67, 0x48},
//    {0x0f, 0xc5},
//    {0x13, 0xff},

//    /* AEC/AGC/AWB */
//    {0x63, 0xe0},
//    {0x14, 0x11},
//    {0x22, 0x3f},
//    {0x23, 0x07},
//    {0x24, 0x40},
//    {0x25, 0x30},
//    {0x26, 0xa1},
//    {0x2b, 0x00},
//    {0x6b, 0xaa},
//    {0x0d, 0x41},

//    /* Sharpness. */
//    {0x90, 0x05},
//    {0x91, 0x01},
//    {0x92, 0x03},
//    {0x93, 0x00},

//    /* Matrix. */
//    {0x94, 0x90},
//    {0x95, 0x8a},
//    {0x96, 0x06},
//    {0x97, 0x0b},
//    {0x98, 0x95},
//    {0x99, 0xa0},
//    {0x9a, 0x1e},

//    /* Brightness. */
//    {0x9b, 0x08},
//    /* Contrast. */
//    {0x9c, 0x20},
//    /* UV */
//    {0x9e, 0x81},
//    /* DSE */
//    {0xa6, 0x04},

//    /* Gamma. */
//    {0x7e, 0x0c},
//    {0x7f, 0x16},
//    {0x80, 0x2a},
//    {0x81, 0x4e},
//    {0x82, 0x61},
//    {0x83, 0x6f},
//    {0x84, 0x7b},
//    {0x85, 0x86},
//    {0x86, 0x8e},
//    {0x87, 0x97},
//    {0x88, 0xa4},
//    {0x89, 0xaf},
//    {0x8a, 0xc5},
//    {0x8b, 0xd7},
//    {0x8c, 0xe8},

//};

static status_t cambus_writes(uint8_t slv_addr, const ov7725_reg_t regs[], uint32_t num)
{
    status_t status = kStatus_Success;

    for (uint32_t i = 0; i < num; i++)
    {
        status = cambus_writeb(slv_addr, regs[i].reg, regs[i].val);

        if (kStatus_Success != status)
        {
            break;
        }
    }

    return status;
}
const int resolution[][2] = {
    {0,    0   },
    // C/SIF Resolutions
    {88,   72  },    /* QQCIF     */
    {176,  144 },    /* QCIF      */
    {352,  288 },    /* CIF       */
    {88,   60  },    /* QQSIF     */
    {176,  120 },    /* QSIF      */
    {352,  240 },    /* SIF       */
    // VGA Resolutions
    {40,   30  },    /* QQQQVGA   */
    {80,   60  },    /* QQQVGA    */
    {160,  120 },    /* QQVGA     */
    {320,  240 },    /* QVGA      */
    {640,  480 },    /* VGA       */
    {60,   40  },    /* HQQQVGA   */
    {120,  80  },    /* HQQVGA    */
    {240,  160 },    /* HQVGA     */
    // FFT Resolutions
    {64,   32  },    /* 64x32     */
    {64,   64  },    /* 64x64     */
    {128,  64  },    /* 128x64    */
    {128,  128 },    /* 128x64    */
    // Other
    {128,  160 },    /* LCD       */
    {128,  160 },    /* QQVGA2    */
    {720,  480 },    /* WVGA      */
    {752,  480 },    /* WVGA2     */
    {800,  600 },    /* SVGA      */
    {1280, 1024},    /* SXGA      */
    {1600, 1200},    /* UXGA      */
};
/* OV7725 connect to CSI. */
static csi_resource_t csiResource = {
    .csiBase = CSI,
};

static csi_private_data_t csiPrivateData;

camera_receiver_handle_t cameraReceiver = {
    .resource = &csiResource, .ops = &csi_ops, .privateData = &csiPrivateData,
};

static void OV7725_DelayMs(uint32_t ms)
{
    volatile uint32_t i;
    uint32_t loopPerMs = SystemCoreClock / 3000;

    while (ms--)
    {
        i = loopPerMs;
        while (i--)
        {
        }
    }
}

void sensor_gpio_init(void)
{
    gpio_pin_config_t config = {
        kGPIO_DigitalOutput, 0,
    };
    GPIO_PinInit(DCMI_RESET_PORT, DCMI_RESET_PIN, &config);
	GPIO_PinInit(DCMI_PWDN_PORT, DCMI_PWDN_PIN, &config);

