davidhuwyler/openmv/src/omv_imxrt/sensor.c
	//DEBUG PIN EMC_41 (Name:ENET_MDIO)
	GPIO_PinInit(DEBUG_PIN_PORT, DEBUG_PIN, &config);
	DEBUG_PIN_LOW();
}


static void BOARD_PullCameraResetPin(bool pullUp)
{
    if (pullUp)
    {
    	DCMI_RESET_HIGH();
    }
    else
    {
    	DCMI_RESET_LOW();
    }
}

static void BOARD_PullCameraPowerDownPin(bool pullUp)
{
    if (pullUp)
    {
    	DCMI_PWDN_HIGH();
    }
    else
    {
    	DCMI_PWDN_LOW();
    }
}

void sensor_init0()
{
    // Init FB mutex
    mutex_init(&JPEG_FB()->lock);

    // Save fb_enabled flag state
    int fb_enabled = JPEG_FB()->enabled;

    // Clear framebuffers
    memset(MAIN_FB(), 0, sizeof(*MAIN_FB()));
    memset(JPEG_FB(), 0, sizeof(*JPEG_FB()));

    // Set default quality
    JPEG_FB()->quality = 35;

    // Set fb_enabled
    JPEG_FB()->enabled = fb_enabled;
}
uint32_t activeFrameAddr;
uint32_t inactiveFrameAddr;

CSI_Type *s_pCSI = CSI;

//				 			8bit | PixRisEdge | gatedClk  | SyncClrFifo| HSyncActHigh|SofOnVsyncRis|ExtVSync
#define CSICR1_INIT_VAL 	0<<0 | 1<<1	      | 1<<4	  | 1<<8	   | 1<<11		 | 1<<17	   |1<<30   


//TODO Dave: Bug in Software if buffer is enlarged... (Frame has some cutts every #Fragmet Lines
//Dave: This buffer is in DTC Memo--> Fast
uint64_t s_dmaFragBufs[2][640 * 2 / 8];	// max supported line length = 1280Byte = 640pixel in RGB

typedef struct _CSIIrq_t
{
	uint8_t isStarted;
	uint8_t isGray;
	uint32_t base0;
	uint32_t linePerFrag;
	uint32_t cnt;
	uint32_t dmaBytePerLine;
	uint32_t dmaBytePerFrag;
	uint32_t dmaFragNdx;

	uint32_t datBytePerLine;
	uint32_t datBytePerFrag;
	uint32_t datFragNdx;

	uint32_t datCurBase;

	uint32_t fragCnt;
	// in color mode, dmaFragNdx should == datLineNdx
	// in gray mode, to save memory, move backword nextDmaBulk every 4 lines
	
}CSIIrq_t;
volatile CSIIrq_t s_irq;

typedef union {
	uint8_t u8Ary[4][2];
	struct {
		uint8_t y0, u0, y1, v0, y2, u2, y3, v2;
	};
	
}YUV64bit_t;


__attribute__((naked))
RAM_CODE uint32_t ExtractYFromYuv(uint32_t dmaBase, uint32_t datBase, uint32_t _128bitUnitCnt) {
	__asm volatile (
		"	push	{r1-r7, ip, lr}  \n "
		"10:  \n "
		"	ldmia	r0!, {r3-r6}  \n "
			// schedule code carefully to allow dual-issue on Cortex-M7
		"	bfi		r7, r3, #0, #8  \n "	// Y0
		"	bfi		ip, r5, #0, #8  \n "	// Y4
		"	lsr		r3,	r3,	#16  \n "
		"	lsr		r5,	r5,	#16  \n "
		"	bfi		r7, r3, #8, #8  \n "	// Y1
		"	bfi		ip, r5, #8, #8  \n "  // Y5
		"	bfi		r7, r4, #16, #8  \n " // Y2
		"	bfi		ip, r6, #16, #8  \n " // Y6
		"	lsr		r4,	r4,	#16  \n "
		"	lsr		r6,	r6,	#16  \n "
		"	bfi		r7, r4, #24, #8  \n " // Y3
		"	bfi		ip, r6, #24, #8  \n "	// Y7
		"	stmia	r1!, {r7, ip}  \n "	
		"	subs	r2,	#1  \n "
		"	bne		10b  \n "
		"	mov		r0,	r1  \n "
		"	pop		{r1-r7, ip, pc}  \n "		
	);
}

RAM_CODE void CSI_IRQHandler(void) {
    uint32_t csisr = s_pCSI->CSISR;
    /* Clear the error flags. */
    s_pCSI->CSISR = csisr;

	if (csisr & (1<<16)) //Start Of Frame Interrupt
	{
		// VSync
		//               SOF    | FB1    | FB2    irqEn
		s_pCSI->CSICR1 = 1U<<16 | 1U<<19 | 1U<<20 | CSICR1_INIT_VAL;
		//				 16 doubleWords| RxFifoDmaReqEn| ReflashRFF|ResetFrmCnt
		s_pCSI->CSICR3 = 2<<4          | 1<<12         | 1<<14     |1<<15;
	}
	else if (csisr & (3<<19)) //DMA Transfer Done Interrupt,  either in FB1 or FB2
	{
		uint32_t dmaBase, lineNdx = s_irq.dmaFragNdx * s_irq.linePerFrag;

		//Switch between the two LineBuffers
		if (s_irq.dmaFragNdx & 1)
			dmaBase = s_pCSI->CSIDMASA_FB2;
		else
			dmaBase = s_pCSI->CSIDMASA_FB1;

		if (dmaBase >= 0x20200000) //LineBuffer not in Unchached region?
			DCACHE_CleanInvalidateByRange(dmaBase, s_irq.dmaBytePerFrag);

		if (s_irq.isGray || 
			(s_sensor.isWindowing &&  lineNdx >= s_sensor.wndY && lineNdx - s_sensor.wndY <= s_sensor.wndH) )
		{
			dmaBase += s_sensor.wndX * 2 * s_irq.linePerFrag;	// apply line window offset
			if (s_irq.isGray) {
				s_irq.datCurBase = ExtractYFromYuv(dmaBase, s_irq.datCurBase, (s_sensor.wndW * s_irq.linePerFrag) >> 3);
			}
			else {
				uint32_t byteToCopy = (s_sensor.wndW * s_irq.linePerFrag) << 1;
				memcpy((void*)s_irq.datCurBase, (void*)dmaBase, byteToCopy);
				s_irq.datCurBase += byteToCopy;
			}
		}
#ifdef USE_LineBuffer
		else if (!s_sensor.isWindowing)
		{
			uint32_t byteToCopy = (s_irq.dmaBytePerFrag);
			memcpy((void*)s_irq.datCurBase, (void*)dmaBase, byteToCopy);
			s_irq.datCurBase += byteToCopy;
		}
#endif //USE_LineBuffer

		//Last Fragment in Frame or Both DMA FBs are Full:
		if (++s_irq.dmaFragNdx == s_irq.fragCnt || (csisr & (3<<19)) == 3<<19 )
		{
			CSI_Stop(CSI);
			//				 16 doubleWords| ReflashRFF
			s_pCSI->CSICR3 = 2<<4		   | 1<<14;
			NVIC_DisableIRQ(CSI_IRQn);
			s_isOmvSensorSnapshotReady = 1;	
			goto Cleanup;
		}
		

		if (csisr & (1<<19) ) {
#ifndef USE_LineBuffer
			if (!s_irq.isGray && !s_sensor.isWindowing)
				s_pCSI->CSIDMASA_FB1 += 2 * s_irq.dmaBytePerFrag;
#endif //#ifdef USE_LineBuffer
		} else {
#ifndef USE_LineBuffer
			if (!s_irq.isGray && !s_sensor.isWindowing)
				s_pCSI->CSIDMASA_FB2 += 2 * s_irq.dmaBytePerFrag;
#endif //USE_LineBuffer
			s_pCSI->CSICR3 |= CSI_CSICR3_DMA_REFLASH_RFF_MASK;	// reload DMA
		}
	}
Cleanup:
	return;
}

void CsiFragModeInit(void) {

	CLOCK_EnableClock(kCLOCK_Csi);
	CSI_Reset(CSI);
	
	s_pCSI->CSICR1 = CSICR1_INIT_VAL;
	s_pCSI->CSICR2 = 3U << 30;	// INCR16 for RxFIFO DMA
	s_pCSI->CSICR3 = 2U << 4;	// 16 double words to trigger DMA request
	s_pCSI->CSIFBUF_PARA = 0;	// no stride


	s_pCSI->CSICR18 = 13<<12 | 1<<18;	// HProt AHB bus protocol, write to memory when CSI_ENABLE is 1

	NVIC_SetPriority(CSI_IRQn, IRQ_PRI_CSI);
}

//Calculates how many lines are read by one DMA Transfer
void CsiFragModeCalc(void) {
	s_irq.datBytePerLine = s_irq.dmaBytePerLine = s_sensor.fb_w * 2;
	if (s_sensor.pixformat == PIXFORMAT_GRAYSCALE) {
		s_irq.datBytePerLine /= 2;	// only contain Y
		s_irq.isGray = 1;
		s_sensor.gs_bpp = 1;
	} else {
		s_irq.isGray = 0;
		s_sensor.gs_bpp = 2;
	}
	if (s_sensor.fb_w == 0 || s_sensor.fb_h == 0)
		return;

	// calculate max bytes per DMA frag (How many Lines are read by one DMA Tranfer)
	uint32_t dmaBytePerFrag, byteStep, dmaByteTotal;
	uint32_t maxBytePerLine = sizeof(s_dmaFragBufs) / ARRAY_SIZE(s_dmaFragBufs);
	dmaByteTotal = s_sensor.fb_w * s_sensor.fb_h * 2;	
	if (s_sensor.wndX == 0 && s_sensor.wndY == 0) // No Windowing mode
	{
		dmaBytePerFrag = s_irq.dmaBytePerLine;  // set a minimal default value
		for (byteStep = s_irq.dmaBytePerLine; byteStep < maxBytePerLine; byteStep += s_irq.dmaBytePerLine) {
			if (0 == byteStep % 32 )
			{
				// find maximum allowed bytes per frag
				dmaBytePerFrag = (maxBytePerLine / byteStep) * byteStep;
				for (; dmaBytePerFrag >= byteStep; dmaBytePerFrag -= byteStep) {
					if (dmaByteTotal % dmaBytePerFrag == 0)
						break;
				}
				if (dmaBytePerFrag < byteStep) {
					dmaBytePerFrag = byteStep;
					while (1) {}
				}
				break;
			}
		}
	} 
	else {
		// for window mode, we only accept 1 line per frag
		dmaBytePerFrag = s_irq.dmaBytePerLine;
	}
	s_irq.linePerFrag = dmaBytePerFrag / s_irq.dmaBytePerLine;
	s_irq.dmaBytePerFrag = dmaBytePerFrag;
	s_irq.datBytePerLine = s_irq.isGray ? dmaBytePerFrag / 2 : dmaBytePerFrag;

