davidhuwyler/openmv/src/omv_imxrt/sensor.c
	// >>> calculate how many lines per fragment (DMA xfer unit)
	uint32_t burstBytes;
	if (!(s_irq.dmaBytePerLine % (8 * 16)))
	{
		burstBytes = 128;
		s_pCSI->CSICR2 = CSI_CSICR2_DMA_BURST_TYPE_RFF(3U);
		s_pCSI->CSICR3 = (CSI->CSICR3 & ~CSI_CSICR3_RxFF_LEVEL_MASK) | ((2U << CSI_CSICR3_RxFF_LEVEL_SHIFT));
	}
	else if (!(s_irq.dmaBytePerLine % (8 * 8)))
	{
		burstBytes = 64;
		s_pCSI->CSICR2 = CSI_CSICR2_DMA_BURST_TYPE_RFF(2U);
		s_pCSI->CSICR3 = (CSI->CSICR3 & ~CSI_CSICR3_RxFF_LEVEL_MASK) | ((1U << CSI_CSICR3_RxFF_LEVEL_SHIFT));
	}
	else
	{
		burstBytes = 32;
		s_pCSI->CSICR2 = CSI_CSICR2_DMA_BURST_TYPE_RFF(1U);
		s_pCSI->CSICR3 = (CSI->CSICR3 & ~CSI_CSICR3_RxFF_LEVEL_MASK) | ((0U << CSI_CSICR3_RxFF_LEVEL_SHIFT));
	}
	s_irq.fragCnt = s_sensor.fb_h / s_irq.linePerFrag;
	// <<<
}

void CsiFragModeStartNewFrame(void) {
	CsiFragModeCalc();
	s_irq.dmaFragNdx = 0;
	s_irq.cnt++;
	// DMA also writes to this cache line, to avoid being invalidated, clean MAIN_FB header.
#ifndef USE_LineBuffer
	//DCACHE_CleanByRange((uint32_t)MAIN_FB(), 32);
#endif //USE_LineBuffer

#ifdef USE_LineBuffer
	s_pCSI->CSIDMASA_FB1 = (uint32_t) s_dmaFragBufs[0];
	s_pCSI->CSIDMASA_FB2 = (uint32_t) s_dmaFragBufs[1];
#else
	if (s_irq.isGray || s_sensor.isWindowing) {
		s_pCSI->CSIDMASA_FB1 = (uint32_t) s_dmaFragBufs[0];
		s_pCSI->CSIDMASA_FB2 = (uint32_t) s_dmaFragBufs[1];
	} else {
		s_pCSI->CSIDMASA_FB1 = s_irq.base0;
		s_pCSI->CSIDMASA_FB2 = s_irq.base0 + s_irq.dmaBytePerFrag;
	}
#endif //USE_LineBuffer
	s_irq.datCurBase = s_irq.base0; // + s_sensor.wndY * s_irq.datBytePerLine + s_sensor.wndX * s_sensor.gs_bpp;
	s_pCSI->CSICR1 = CSICR1_INIT_VAL | 1<<16;	// enable SOF iRQ
	if (s_irq.dmaBytePerFrag & 0xFFFF0000) {
		
		uint32_t l16 = s_irq.linePerFrag , h16 = s_irq.dmaBytePerLine << 16;
		s_pCSI->CSIIMAG_PARA = l16 | h16;
	} else {
		s_pCSI->CSIIMAG_PARA = 1U | s_irq.dmaBytePerFrag << 16;	// CSI_IRQ every <dmaBytePerFrag>
	}
	__set_PRIMASK(1);
	s_pCSI->CSISR = s_pCSI->CSISR;
	s_pCSI->CSICR18 |= 1U<<31;	// start CSI
	NVIC_EnableIRQ(CSI_IRQn);
	__set_PRIMASK(0);	
}
#define CAMERA_TAKE_SNAPSHOT() CsiFragModeStartNewFrame()

#define CAMERA_WAIT_FOR_SNAPSHOT() do { \
	while (0 == s_isOmvSensorSnapshotReady) {} \
	s_isOmvSensorSnapshotReady = 0; \
	}while(0)
volatile uint8_t s_isEnUsbIrqForSnapshot;

int sensor_init()
{   
	#ifndef XIP_EXTERNAL_FLASH
	s_isEnUsbIrqForSnapshot = 1;
	#endif
	sensor_gpio_init();
    cambus_init();
	memset(&s_sensor, 0, sizeof(s_sensor));
	s_irq.base0 = (uint32_t)(MAIN_FB()->pixels);
 //   uint8_t com10=0,com2=0,com3=0,clkrc=0;	
    // Clear sensor chip ID.
    s_sensor.chip_id = 0;
    s_sensor.slv_addr = 0x21U; //?
    s_sensor.snapshot = sensor_snapshot;
    // Read ON semi sensor ID.
    cambus_readb(s_sensor.slv_addr, ON_CHIP_ID, &s_sensor.chip_id);
    if (s_sensor.chip_id == MT9V034_ID) {
        mt9v034_init(&s_sensor);
    } else { // Read OV sensor ID.
        cambus_readb(s_sensor.slv_addr, OV_CHIP_ID, &s_sensor.chip_id);
        // Initialize sensor struct.
        switch (119) { //Directly jump to 0x7725
            case OV9650_ID:
                ov9650_init(&s_sensor);
                break;
            case OV2640_ID:
                ov2640_init(&s_sensor);
                break;
            case OV7725_ID:
                ov7725_init(&s_sensor);
                break;
            default:
                // Sensor is not supported.
                return -3;
        }
    }
    // Clear fb_enabled flag
    // This is executed only once to initialize the FB enabled flag.
   JPEG_FB()->enabled = 0;
   // dcmi_config(); replace this func by the below sentences
    
    
  /*  for(uint8_t i=0;i<=0x3F;i++)     for the test:print the reg of the ov7725
{
    cambus_readb(s_sensor.slv_addr,i,&temp);
    PRINTF("%x \r\n",temp);
}*/
	
    systick_sleep(10);
    BOARD_PullCameraPowerDownPin(true);

    /* Delay 1ms. */
    OV7725_DelayMs(1);

    BOARD_PullCameraPowerDownPin(false);

    /* Delay 1ms. */
    OV7725_DelayMs(1);

    BOARD_PullCameraResetPin(false);

    /* Delay 1ms. */
    OV7725_DelayMs(1);

    BOARD_PullCameraResetPin(true);

    /* Delay 1ms. */
    OV7725_DelayMs(3);

	CsiFragModeInit();

	/* Set PixelClock. */
	//2<<9 = Derive Clock from USBPLL:480Mhz/4=120Mhz
	//0<<9 = Derive Clock from OSC_CLK:24Mhz
	//(2-1)<<11 = divide by 2
	//(8-1)<<11 = divide by 8
	//sensor_set_framerate(0x80000000 | (0<<9|(2-1)<<11)); //12Mhz PixClock
	sensor_set_framerate(0x80000000 | (2<<9|(8-1)<<11)); //15Mhz PixClock

	s_sensor.isWindowing = 0;
	s_sensor.wndH = s_sensor.fb_h;
	s_sensor.wndW = s_sensor.fb_w;
	s_sensor.wndX = s_sensor.wndY = 0;


    return 0;
}


int sensor_reset()
{
    // Reset the sesnor state
	s_sensor.sde          = 0xFF;
    s_sensor.pixformat    = 0xFF;
    s_sensor.framesize    = 0xFF;
    s_sensor.framerate    = 0xFF;
    s_sensor.gainceiling  = 0xFF;

    s_sensor.reset(&s_sensor);
	/*
      // Reset all registers
    cambus_writeb(s_sensor.slv_addr, COM7, COM7_RESET);   
    OV7725_DelayMs(2);
    cambus_writes(s_sensor.slv_addr,ov7725InitRegs,ARRAY_SIZE(ov7725InitRegs));  
	*/
    return 0;
}

int sensor_get_id()
{
    return s_sensor.chip_id;
}

int sensor_set_vsync_output(GPIO_Type *gpio, uint32_t pin)
{
    // s_sensor.vsync_pin  = pin;
    // s_sensor.vsync_gpio = gpio;
    return 0;
}

int sensor_sleep(int enable)
{
    if (s_sensor.sleep == NULL
        || s_sensor.sleep(&s_sensor, enable) != 0) {
        // Operation not supported
        return -1;
    }
    return 0;
}

int sensor_read_reg(uint8_t reg_addr)
{
    if (s_sensor.read_reg == NULL) {
        // Operation not supported
        return -1;
    }
    return s_sensor.read_reg(&s_sensor, reg_addr);
}

int sensor_write_reg(uint8_t reg_addr, uint16_t reg_data)
{
    if (s_sensor.write_reg == NULL) {
        // Operation not supported
        return -1;
    }
    return s_sensor.write_reg(&s_sensor, reg_addr, reg_data);
}

int sensor_set_pixformat(pixformat_t pixformat)
{

    if (s_sensor.pixformat == pixformat) {
        // No change
        return 0;
    }

    if (s_sensor.set_pixformat == NULL
        || s_sensor.set_pixformat(&s_sensor, pixformat) != 0) {
        // Operation not supported
        return -1;
    }

