davidhuwyler/openmv/src/omv_imxrt/sensor.c
    // Set pixel format
    s_sensor.pixformat = pixformat;

    // JPEG images from the Camera are not supported...
    if (pixformat == PIXFORMAT_JPEG) {
        return -1;
    }

    // Skip the first frame.
    MAIN_FB()->bpp = 0;
    return 0;
}

int sensor_set_framesize(framesize_t framesize)
{

    // Call the sensor specific function
    if (s_sensor.set_framesize == NULL
        || s_sensor.set_framesize(&s_sensor, framesize) != 0) {
        // Operation not supported
        return -1;
    }

    // Set framebuffer size
    s_sensor.framesize = framesize;

    // Skip the first frame.
    MAIN_FB()->bpp = -1;
    // Set MAIN FB width and height.
    s_sensor.fb_w = MAIN_FB()->w = resolution[framesize][0];
    s_sensor.fb_h = MAIN_FB()->h = resolution[framesize][1];

    // Set MAIN FB backup width and height.
    MAIN_FB()->u = resolution[framesize][0];
    MAIN_FB()->v = resolution[framesize][1];
	s_sensor.wndX = 0; s_sensor.wndY = 0 ; s_sensor.wndW = s_sensor.fb_w ; s_sensor.wndH = s_sensor.fb_h;
	// CsiFragModeCalc();
    return 0;
}

int sensor_set_framerate(framerate_t framerate)
{
    if (s_sensor.framerate == framerate) {
       /* no change */
        return 0;
    }
	if (framerate & 0x80000000)
		CCM->CSCDR3 = framerate & (0x1F<<9);

    /* call the sensor specific function */
    if (s_sensor.set_framerate == NULL
        || s_sensor.set_framerate(&s_sensor, framerate) != 0) {
        /* operation not supported */
        return -1;
    }

    /* set the frame rate */
    s_sensor.framerate = framerate;

    return 0;
}

//The CSI Hardware of the i.MX RT does not Support windowing.
//This implementation saves just the pixels inside the window but all
//pixels are sensed...
int sensor_set_windowing(int x, int y, int w, int h)
{
	w = (w + 7) & ~7 , x = (x + 7) & ~7;
	if (x >= s_sensor.fb_w - 8)
		x = s_sensor.fb_w - 8;
	if (y >= s_sensor.fb_h - 1)
		y = s_sensor.fb_h - 1;
	if (x + w > s_sensor.fb_w)
		w = s_sensor.fb_w - x;
	if (y + h > s_sensor.fb_h)
		h = s_sensor.fb_h - y;

	s_sensor.isWindowing = (w < s_sensor.fb_w && h < s_sensor.fb_h) ? 1 : 0;
	s_sensor.wndX = x ; s_sensor.wndY = y ; s_sensor.wndW = w ; s_sensor.wndH = h;
    MAIN_FB()->w = w;
    MAIN_FB()->h = h;
    return 0;
}

int sensor_set_contrast(int level)
{
    if (s_sensor.set_contrast != NULL) {
        return s_sensor.set_contrast(&s_sensor, level);
    }
    return -1;
}

int sensor_set_brightness(int level)
{
    if (s_sensor.set_brightness != NULL) {
        return s_sensor.set_brightness(&s_sensor, level);
    }
    return -1;
}

int sensor_set_saturation(int level)
{
    if (s_sensor.set_saturation != NULL) {
        return s_sensor.set_saturation(&s_sensor, level);
    }
    return -1;
}

int sensor_set_gainceiling(gainceiling_t gainceiling)
{
    if (s_sensor.gainceiling == gainceiling) {
        /* no change */
        return 0;
    }

    /* call the sensor specific function */
    if (s_sensor.set_gainceiling == NULL
        || s_sensor.set_gainceiling(&s_sensor, gainceiling) != 0) {
        /* operation not supported */
        return -1;
    }

    s_sensor.gainceiling = gainceiling;
    return 0;
}

int sensor_set_quality(int qs)
{
    /* call the sensor specific function */
    if (s_sensor.set_quality == NULL
        || s_sensor.set_quality(&s_sensor, qs) != 0) {
        /* operation not supported */
        return -1;
    }
    return 0;
}

int sensor_set_colorbar(int enable)
{
    /* call the sensor specific function */
    if (s_sensor.set_colorbar == NULL
        || s_sensor.set_colorbar(&s_sensor, enable) != 0) {
        /* operation not supported */
        return -1;
    }
    return 0;
}

int sensor_set_auto_gain(int enable, float gain_db, float gain_db_ceiling)
{
    /* call the sensor specific function */
    if (s_sensor.set_auto_gain == NULL
        || s_sensor.set_auto_gain(&s_sensor, enable, gain_db, gain_db_ceiling) != 0) {
        /* operation not supported */
        return -1;
    }
    return 0;
}

int sensor_get_gain_db(float *gain_db)
{
    /* call the sensor specific function */
    if (s_sensor.get_gain_db == NULL
        || s_sensor.get_gain_db(&s_sensor, gain_db) != 0) {
        /* operation not supported */
        return -1;
    }
    return 0;
}

int sensor_set_auto_exposure(int enable, int exposure_us)
{
    /* call the sensor specific function */
    if (s_sensor.set_auto_exposure == NULL
        || s_sensor.set_auto_exposure(&s_sensor, enable, exposure_us) != 0) {
        /* operation not supported */
        return -1;
    }
    return 0;
}

int sensor_get_exposure_us(int *exposure_us)
{
    /* call the sensor specific function */
    if (s_sensor.get_exposure_us == NULL
        || s_sensor.get_exposure_us(&s_sensor, exposure_us) != 0) {
        /* operation not supported */
        return -1;
    }
    return 0;
}

int sensor_set_auto_whitebal(int enable, float r_gain_db, float g_gain_db, float b_gain_db)
{
    /* call the sensor specific function */
    if (s_sensor.set_auto_whitebal == NULL
        || s_sensor.set_auto_whitebal(&s_sensor, enable, r_gain_db, g_gain_db, b_gain_db) != 0) {
        /* operation not supported */
        return -1;
    }
    return 0;
}

int sensor_get_rgb_gain_db(float *r_gain_db, float *g_gain_db, float *b_gain_db)
{
    /* call the sensor specific function */
    if (s_sensor.get_rgb_gain_db == NULL
        || s_sensor.get_rgb_gain_db(&s_sensor, r_gain_db, g_gain_db, b_gain_db) != 0) {
        /* operation not supported */
        return -1;
    }
    return 0;
}

int sensor_set_hmirror(int enable)
{
    /* call the sensor specific function */
    if (s_sensor.set_hmirror == NULL
        || s_sensor.set_hmirror(&s_sensor, enable) != 0) {
        /* operation not supported */
        return -1;
    }
    return 0;
}

int sensor_set_vflip(int enable)
{
    /* call the sensor specific function */
    if (s_sensor.set_vflip == NULL
        || s_sensor.set_vflip(&s_sensor, enable) != 0) {
        /* operation not supported */
        return -1;
    }
    return 0;
}

int sensor_set_special_effect(sde_t sde)
{
    if (s_sensor.sde == sde) {
        /* no change */
        return 0;
    }

    /* call the sensor specific function */
    if (s_sensor.set_special_effect == NULL
        || s_sensor.set_special_effect(&s_sensor, sde) != 0) {
        /* operation not supported */
        return -1;
    }

