davidhuwyler/openmv/src/omv_imxrt/sensor.c
    s_sensor.sde = sde;
    return 0;
}

int sensor_set_lens_correction(int enable, int radi, int coef)
{
    /* call the sensor specific function */
    if (s_sensor.set_lens_correction == NULL
        || s_sensor.set_lens_correction(&s_sensor, enable, radi, coef) != 0) {
        /* operation not supported */
        return -1;
    }

    return 0;
}

int sensor_ioctl(int request, ... /* arg */)
{
    int ret = -1;
    if (s_sensor.ioctl != NULL) {
        va_list ap;
        va_start(ap, request);
        /* call the sensor specific function */
        ret = s_sensor.ioctl(&s_sensor, request, ap);
        va_end(ap);
    }
    return ret;
}
int sensor_set_color_palette(const uint16_t *color_palette)
{
    s_sensor.color_palette = color_palette;
    return 0;
}

const uint16_t *sensor_get_color_palette()
{
    return s_sensor.color_palette;
}

static void sensor_check_bufsize()
{
    int bpp=0;
    switch (s_sensor.pixformat) {
        case PIXFORMAT_BAYER:
        case PIXFORMAT_GRAYSCALE:
            bpp = 1;
            break;
        case PIXFORMAT_YUV422:
        case PIXFORMAT_RGB565:
            bpp = 2;
            break;
        default:
            break;
    }

    if ((MAIN_FB()->w * MAIN_FB()->h * bpp) > (OMV_RAW_BUF_SIZE)) {
        if (s_sensor.pixformat == PIXFORMAT_GRAYSCALE) {
            // Crop higher GS resolutions to QVGA
            sensor_set_windowing(190, 120, 320, 240);
        } else if (s_sensor.pixformat == PIXFORMAT_RGB565) {
            // Switch to BAYER if the frame is too big to fit in RAM.
            sensor_set_pixformat(PIXFORMAT_BAYER);
        }
    }

}

// The JPEG offset allows JPEG compression of the framebuffer without overwriting the pixels.
// The offset size may need to be adjusted depending on the quality, otherwise JPEG data may
// overwrite image pixels before they are compressed.
int sensor_snapshot(sensor_t *sensor, image_t *pImg, streaming_cb_t streaming_cb)
{
  	sensor = sensor , streaming_cb = streaming_cb;	// keep compatible with original openMV
    sensor_check_bufsize();

    switch (s_sensor.pixformat) {
        case PIXFORMAT_GRAYSCALE:
            MAIN_FB()->bpp = 1;
            break;
        case PIXFORMAT_YUV422:
        case PIXFORMAT_RGB565:
            MAIN_FB()->bpp = 2;
            break;
        case PIXFORMAT_BAYER:
            MAIN_FB()->bpp = 3;
            break;
        case PIXFORMAT_JPEG:
            // Read the number of data items transferred
            // MAIN_FB()->bpp = (MAX_XFER_SIZE - __HAL_DMA_GET_COUNTER(&DMAHandle))*4;
            break;
    }

	static uint8_t n;
	DEBUG_PIN_HIGH();
	if (JPEG_FB()->enabled) {
		fb_update_jpeg_buffer();
	}

	DEBUG_PIN_LOW();
	CAMERA_TAKE_SNAPSHOT();
	HAL_Delay(3); //Time to Transfer the JPEG image to the IDE
	if (!s_isEnUsbIrqForSnapshot)
		NVIC_DisableIRQ(USB_OTG1_IRQn);
	CAMERA_WAIT_FOR_SNAPSHOT();
	if (!s_isEnUsbIrqForSnapshot)
		NVIC_EnableIRQ(USB_OTG1_IRQn);

	n++;

	if (pImg) {
		pImg->w = MAIN_FB()->w , pImg->h = MAIN_FB()->h , pImg->bpp = MAIN_FB()->bpp;
		pImg->pixels = (uint8_t*) MAIN_FB()->pixels;		
	}
    return 0;
}
